app/controllers/university_students_controller.rb

SELECT "university_students".* FROM "university_students"
---
  def index
    @university_students = UniversityStudent.all

INSERT INTO "university_students" ("name", "faculty", "grade", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Jom"], ["faculty", "SKE"], ["grade", "3.41"], ["created_at", "2023-04-03 08:23:12.310533"], ["updated_at", "2023-04-03 08:23:12.310533"]]
---
  def create
    @university_student = UniversityStudent.new(university_student_params)

    respond_to do |format|
      if @university_student.save

UPDATE "university_students" SET "grade" = ?, "updated_at" = ? WHERE "university_students"."id" = ?  [["grade", "3.02"], ["updated_at", "2023-04-03 07:57:54.925613"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @university_student.update(university_student_params)

DELETE FROM "university_students" WHERE "university_students"."id" = $1  [["id", 1]]
---
  def destroy
    @university_student.destroy

SELECT "university_students".* FROM "university_students" WHERE "university_students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_university_student
      @university_student = UniversityStudent.find(params[:id])